export const authorContent = {
  "pravila-oformleniya-statey": {
    title: "Правила оформления статей",
    text: `
      

Материалы, представляемые в редакцию, должны быть оформлены в виде четырёх файлов:
1.  текст статьи с аннотацией и ключевыми словами на русском языке,
2.  информация на английском языке,
3.  сведения об авторе,
4.  скан-копия заверенного бланка согласия pismo-soglasie.doc.

Файлы должны быть поименованы по фамилии автора в латинской графике (например, Ivanov1, Ivanov2, Ivanov3, Ivanov4).

Бланк согласия должен быть подписан автором и заверен в организации, в которой он работает или обучается.

Максимальный объём статьи – 12 страниц .

Материалы прикрепляются на сайте журнала после регистрации автора.

На указанный при регистрации адрес электронной почты будут высылаться автоматические уведомления  об изменении статуса статьи (результат рецензирования, ориентировочные сроки опубликования и т.д.).

Статьи, присланные по электронной почте, не рассматриваются.

В случае несоблюдения каких-либо требований редакция оставляет за собой право не рассматривать такие статьи.
    `,
  },
  "oformlenie-statey": {
    title: "Оформление статей",
    text: `
     

Редакция принимает статьи, набранные в текстовом редакторе WinWord, статьи должны быть представлены в электронном. Иллюстрации (рисунки, таблицы, графики, диаграммы и т.п.) дополнительно предоставляются в отдельных файлах, вложенных в авторскую электронную папку.
Все рисунки публикуются в черно-белой гамме, полноцветные иллюстрации будут доступны только в электронной версии статьи.

В начале статьи указывается номер по Универсальной десятичной классификации (УДК),

приводятся (каждый раз с новой строки):
1) инициалы и фамилия автора,
2) название статьи (строчными буквами, например: Иерархия универсума в ранней прозе Флобера),

3) её краткая аннотация (500 знаков, считая пробелы), аннотация выделяется курсивом и отделяется от текста статьи пропуском строки,
4) ключевые слова (5 - 10).
Текст набирается шрифтами Times New Roman, размер шрифта – 10 кеглей, межстрочный интервал – одинарный, поля (все) – 2,0 см, абзацный отступ – 0,5 см.
При использовании дополнительных шрифтов при наборе статьи такие шрифты должны быть представлены в редакцию в авторской электронной папке.
Нумерация страниц сплошная, с 1-ой страницы, внизу по центру.

Ссылки на использованные источники приводятся после цитаты в квадратных скобках с указанием порядкового номера источника цитирования, тома и страницы, например [1. Т. 2. С. 25]. Список литературы располагается после текста статьи, нумеруется (начиная с первого номера), предваряется словом «Литература» и оформляется в порядке упоминания или цитирования в тексте статьи (не в алфавитном порядке!). Под одним номером допустимо указывать только один источник.
Примечания оформляются в виде концевых сносок. Если в примечаниях присутствуют ссылки на используемую литературу,  номер этих источников в списке литературы должен быть соотнесён с нумерацией источников в основном тексте статьи, после которых  (перед которыми) вставлено примечание со ссылкой на источник.

    `,
  },
  "informaciya-na-angliyskom-yazyke": {
    title: "Информация на английском языке",
    text: `

Информация на английском языке включает:

1) английский вариант фамилии, имени и отчества автора, перевод названия своей организации и  названия статьи на английский язык, например: Ivan I.  Ivanov, Tomsk State University (Tomsk, Russian Federation). E-mail: ivanov@ivanov.ru

The hierarchy of the Universe in Flaubert's early prose;

2) перевод на английский язык ключевых слов;

3) автореферат (расширенную аннотацию) статьи на английском языке (2500 – 3000 печатных знаков, включая пробелы) и исходный текст автореферата на русском языке.

Важно: автореферат (расширенная аннотация) должен быть структурирован в соответствии с жанром: какую проблему решает автор (цель статьи), на каком материале, какими методами, ход исследования, выводы, к которым автор пришел (или которые доказал). Все эти моменты должны быть последовательно и логично изложены. Кроме того, автореферат статьи не должен содержать излишнего теоретизирования, а, наоборот, отражать сущностные моменты проведенного исследования. 

    `,
  },
  "svedeniya-ob-avtorakh": {
    title: "Сведения об авторах",
    text: `
      

Сведения включают:
– фамилию, имя, отчество (полностью);
– учёную степень (если есть);
– должность, структурное подразделение (кафедра / лаборатория / сектор и т.д.), название своей организации без сокращений, город, например:

КАМИНСКИЙ Петр Петрович – канд. филол. наук, доцент кафедры теории и практики журналистики Томского государственного университета (Томск).

E-mail: kpp@hq.tsc.ru 
В том же файле указываются:
– название и номер специальности, по которой написана статья;
– номер контактного телефона (необходим только для связи редакции с автором).

    `,
  },
  "poryadok-recenzirovaniya-rukopisej-statej": {
    title: "Порядок рецензирования рукописей статей",
    text: `
     
Порядок рецензирования рукописей статей, поступивших в редакцию научного журнала                    «Вестник томского государственного университета»

Все статьи, поступившие в редакцию, проходят независимое рецензирование
1. Рукопись научной статьи, поступившая в редакцию журнала, рассматривается ответственным секретарем на предмет соответствия профилю журнала, основным положениям требований к публикациям, оформлению, утвержденным редакционной коллегией журнала («Правила оформления статей»).
О поступлении статьи и ее дальнейшем рецензировании ответственный секретарь сообщает авторам посредством автоматического уведомления по электронной почте после внесения соответствующих изменений в профиле автора на сайте журнала. Если формальные требования к материалам на публикацию не выполнены, то статья к публикации не принимается «по формальным признакам» и об этом сообщается автору посредством автоматического уведомления.
2. Ответственный секретарь направляет статью на рецензирование двум рецензентам. Для проведения рецензирования рукописей статей в качестве рецензентов могут привлекаться как члены редакционной коллегии журнала, так и высококвалифицированные ученые и специалисты других организаций, обладающие глубокими профессиональными знаниями и опытом работы по конкретному научному направлению.
3. Сроки рецензирования в каждом отдельном случае определяются с учетом создания условий для оперативной публикации статьи, но в среднем составляют около 6 месяцев.
4. Рецензирование «двустороннее слепое»: автору не сообщаются данные о рецензенте (рецензентах). Автор получает рецензию без подписи и указания фамилии, должности, места работы рецензента.
5. Если в рецензии содержатся рекомендации по исправлению и доработке статьи, ответственный секретарь журнала направляет автору текст рецензии с предложением учесть их при подготовке нового варианта статьи или аргументировано (частично или полностью) их опровергнуть.
6. Статья, направленная автору на доработку, должна быть возвращена в исправленном виде в течение месяца. К переработанной рукописи необходимо приложить письмо от авторов, содержащее ответы на все замечания и поясняющее все изменения, сделанные в статье (отдельным файлом и по тексту статьи выделить изменения цветом). Доработанная (переработанная) автором статья повторно направляется на рецензирование и прилагается ответ рецензенту (вариант ответа на рецензию «Спасибо уважаемому рецензенту за внимательное прочтение нашей работы, …. мы постарались учесть все замечания…, но в тоже время…..»). Датой поступления в редакцию считается дата возвращения доработанной статьи.
7. Редакция оставляет за собой право отклонения статей в случае неспособности или нежелания автора учесть пожелания редакции.
8. Статья, не рекомендованная рецензентом к публикации, к повторному рассмотрению не принимается.
9. При наличии отрицательных рецензий на рукопись или на ее доработанный вариант статья отклоняется с обязательным уведомлением автора о причинах такого решения.
10. Не допускаются к публикации в научном журнале:
– статьи, содержащие  ранее опубликованный материал
– статьи, оформленные без соблюдения правил оформления статей;
– статьи, авторы которых не исполняют требования редакции по технической доработке статей;
– статьи, авторы которых не выполняют конструктивные замечания рецензента или аргументировано не опровергают их;
– серии статей, представляющие собой отдельные этапы незавершённых исследований.
11. Применение инструментов искусственного интеллекта должно документироваться авторами статьи в разделе методов исследования. Редакция имеет право отклонить рукопись, если, в том числе с использованием технических средств, установлен факт использования инструментов искусственного интеллекта, однако в тексте статьи автором это не отражено.
12. После принятия редколлегией журнала решения о допуске статьи к публикации ответственный секретарь журнала информирует об этом автора посредством автоматического уведомления и указывает возможные сроки публикации.
13. Очерёдность публикации статей определяется регистрационной датой их поступления в редакцию. Работы, посвящённые особо актуальным проблемам науки, а также содержащие принципиально новую информацию, могут, по решению редакционной коллегии, быть опубликованы вне очереди.

Редакция не вступает с авторами в содержательное обсуждение статей, переписку по методике написания и оформления научных статей и не занимается доводкой статей до необходимого научно-методического уровня.

    `,
  },
};
