(()=>{var e={};e.id=312,e.ids=[312],e.modules={846:e=>{"use strict";e.exports=require("next/dist/compiled/next-server/app-page.runtime.prod.js")},9121:e=>{"use strict";e.exports=require("next/dist/server/app-render/action-async-storage.external.js")},3295:e=>{"use strict";e.exports=require("next/dist/server/app-render/after-task-async-storage.external.js")},9294:e=>{"use strict";e.exports=require("next/dist/server/app-render/work-async-storage.external.js")},3033:e=>{"use strict";e.exports=require("next/dist/server/app-render/work-unit-async-storage.external.js")},3873:e=>{"use strict";e.exports=require("path")},9551:e=>{"use strict";e.exports=require("url")},7633:(e,t,o)=>{"use strict";o.r(t),o.d(t,{GlobalError:()=>a.a,__next_app__:()=>p,pages:()=>c,routeModule:()=>u,tree:()=>d});var r=o(260),i=o(8203),s=o(5155),a=o.n(s),n=o(7292),l={};for(let e in n)0>["default","tree","pages","GlobalError","__next_app__","routeModule"].indexOf(e)&&(l[e]=()=>n[e]);o.d(t,l);let d=["",{children:["editorials",{children:["editorial",{children:["[category]",{children:["__PAGE__",{},{page:[()=>Promise.resolve().then(o.bind(o,2002)),"/home/shaxzodbr/Desktop/Azizi/Azizi/app/editorials/editorial/[category]/page.tsx"]}]},{}]},{}]},{metadata:{icon:[async e=>(await Promise.resolve().then(o.bind(o,6055))).default(e)],apple:[],openGraph:[],twitter:[],manifest:void 0}}]},{layout:[()=>Promise.resolve().then(o.bind(o,638)),"/home/shaxzodbr/Desktop/Azizi/Azizi/app/layout.tsx"],"not-found":[()=>Promise.resolve().then(o.t.bind(o,9937,23)),"next/dist/client/components/not-found-error"],forbidden:[()=>Promise.resolve().then(o.t.bind(o,9116,23)),"next/dist/client/components/forbidden-error"],unauthorized:[()=>Promise.resolve().then(o.t.bind(o,1485,23)),"next/dist/client/components/unauthorized-error"],metadata:{icon:[async e=>(await Promise.resolve().then(o.bind(o,6055))).default(e)],apple:[],openGraph:[],twitter:[],manifest:void 0}}],c=["/home/shaxzodbr/Desktop/Azizi/Azizi/app/editorials/editorial/[category]/page.tsx"],p={require:o,loadChunk:()=>Promise.resolve()},u=new r.AppPageRouteModule({definition:{kind:i.RouteKind.APP_PAGE,page:"/editorials/editorial/[category]/page",pathname:"/editorials/editorial/[category]",bundlePath:"",filename:"",appPaths:[]},userland:{loaderTree:d}})},4809:(e,t,o)=>{Promise.resolve().then(o.bind(o,2002))},3278:(e,t,o)=>{Promise.resolve().then(o.bind(o,3249))},3249:(e,t,o)=>{"use strict";o.r(t),o.d(t,{default:()=>a});var r=o(5512),i=o(8686);let s={history:{title:"История",description:`

VASILIY P. ZINOVIEV, Chairman of the Academic Editorial Board, Doctor of History, Professor, Head of the Department of Russian History, Dean of the Faculty of History, Tomsk State University (Russian Federation)

Tel.: +7-(382-2)-529-796; +7-(382-2)-529-836

E-mail: vpz@tsu.ru

PYOTR P. RUMYANTSEV, Executive Editor, PhD (History), Associate Professor of the Faculty of History, Tomsk State University (Russian Federation)

Tel.: +7-(382-2)-529-836

E-mail: petroom@mail.ru

VLADIMIR G. DATSYSHEN, Doctor of History, Professor, Head of the Department of  World History, Siberian Federal University (Krasnoyarsk, Russian Federation)

ELENA E. DUTCHAK, Doctor of History, Professor of the Department of Russian History, Tomsk State University (Russian Federation)

NATALIA A. IVANOVA, Doctor of History, Senior Researcher, Institute of Russian History of the Russian Academy of Sciences (Moscow, Russian Federation)

YURIY F. KIRYUSHIN, Doctor of History, Professor, President of Altai State University (Barnaul, Russian Federation)

SERGEY A. KRASILNIKOV, Doctor of History, Professor, Head of the Department of Russian History, Novosibirsk State University (Russian Federation)

SERGEY G. LUZYANIN, Doctor of History, Professor, Deputy Director of the Institute of Far Eastern Studies of the Russian Academy of Sciences (Russian Federation)

AUDE MERLIN, PhD (History), Professor of the Free University of Brussels (Belgium)
DMITRY A. FUNK, Doctor of History, Professor, Head of the Department of Ethnology of Moscow State University (Russian Federation)

ZHARAS A. YERMEKBAI, Doctor of History, Professor of Department of Social and Humanitarian Disciplines, Kazakhstan Branch of Lomonosov Moscow State University (Astana, Kazakhstan) 

SERGEY G. SULYAK, PhD (History), Associate Professor of Shevchenko Transnistria State University (Tiraspol, Moldova) 

ALISHER G. MUMINOV, Doctor of Political Sciences, Professor, Dean of the Historical Faculty, National University of Uzbekistan (Tashkent, Uzbekistan)

EDUARD I. CHERNYAK, Doctor of History, Professor, Director of the Institute of Arts and Culture, Tomsk State University (Russian Federation)

LYUDMILA A. CHINDINA, Doctor of History, Professor of the Faculty of History, Tomsk State University (Russian Federation)

LYUDMILA I. SHERSTOVA, Doctor of History, Professor of the Department of  Russian History, Tomsk State University (Russian Federation)
`},pedagogy_general:{title:"Общая педагогика",description:`

Абакумова Наталия Николаевна – ответственный секретарь
кандидат педагогических наук, доцент факультета психологии Национального исследовательского Томского государственного университета, главный внештатный педагог-психолог Министерства просвещения по Сибирскому Федеральному округу (Россия)

Асьоли да Силва-Ренье Наджа Мария
доктор наук, профессор Федерального государственного университета Пернамбуко, член бразильского академического центра UNIFRA (Бразилия)

Костюкова Татьяна Анатольевна
доктор педагогических наук, профессор факультета психологии Национального исследовательского Томского государственного университета (Россия)

Куравский Лев Семенович
доктор технических наук, декан факультета информационных технологий Московского государственного психолого-педагогического университета (Россия) 

Малкова Ирина Юрьевна
доктор педагогических наук, профессор факультета психологии Национального исследовательского Томского государственного университета (Россия)

Ренье Жан-Клод
доктор наук, профессор Университета Люмьер Лион 2, член Института педагогических наук и практик образования (ISPEF) и лаборатории UMR 5191 ICAR (Франция)
 
Рубцов Виталий Владимирович
доктор психологических наук, президент Московского государственного психолого-педагогического университета, академик Российской академии образования, президент Федерации психологов образования России (Россия)

Сенько Юрий Васильевич
доктор педагогических наук, профессор Алтайского государственного университета, академик Российской академии образования (Россия)

Фрумин Исак Давидович
доктор педагогических наук, научный руководитель Института образования Национального исследовательского университета "Высшая школа экономики" (Россия)

Фахрутдинова Анастасия Викторовна
доктор педагогических наук, профессор Института международных отношений Казанского (Приволжского) федерального университета (Россия)
`},pedagogy_languages:{title:"Преподавание языков",description:`

Обдалова Ольга Андреевна – председатель научной редакции
доктор педагогических наук, доцент, профессор кафедры методики обучения иностранным языкам и междисциплинарных исследований образования Национального исследовательского Томского государственного университета (Россия); врио заведующего кафедрой иностранных языков Томского научного центра Сибирского отделения Российской академии наук, Почетный работник высшего профессионального образования РФ (Россия)

Денмар Кристофер
научный сотрудник офиса заместителя проректора по аспирантуре и исследованиям Университета Султана Кабуса (Оман)

Житкова Елена Викторовна
кандидат педагогических наук, доцент департамента иностранных языков Национального исследовательского Томского государственного университета (Россия)

Кирнер-Людвиг Моника
PhD, доцент кафедры английского языка Университета г. Инсбрук (Австрия)

Краснощекова Галина Алексеевна
доктор педагогических наук, доцент, заведующий кафедрой иностранных языков Института управления в экономических, экологических и социальных системах Южного федерального университета (Россия)

Медведева Лариса Георгиевна
кандидат педагогических наук, доцент, доцент кафедры методики обучения иностранным языкам и междисциплинарных исследований образования Национального исследовательского Томского государственного университета (Россия)

Попова Татьяна Георгиевна
доктор филологических наук, профессор, профессор кафедры английского языка факультета иностранных языков Военного университета Министерства обороны РФ, Почетный работник сферы образования РФ, Заслуженный работник высшей школы РФ, Академик РАЕ (Россия)

Самбурский Денис Николаевич
PhD, профессор кафедры языков, литературы и лингвистики Сиракузского университета (США)

Соболева Александра Владимировна
кандидат педагогических наук, доцент кафедры английского языка в сфере научной коммуникации Национального исследовательского Томского государственного университета (Россия)

Чикнаверова Карине Григорьевна
доктор педагогических наук, профессор кафедры английского языка Московского государственного института международных отношений (университета) Министерства иностранных дел Российской Федерации (Россия)

Шульгина Елена Модестовна
кандидат педагогических наук, доцент, заведующий кафедрой английского языка в сфере научной коммуникации Национального исследовательского Томского государственного университета (Россия)
`},pedagogy_sport:{title:"Физическая культура",description:"Описание..."},law:{title:"Право",description:`Уткин Владимир Александрович - председатель совета
доктор юридических наук, профессор, Директор Юридического института Национального исследовательского Томского государственного университета, Заслуженный юрист Российской Федерации (Россия)
 
Ахмедшин Рамиль Линарович - ответственный секретарь
доктор юридических наук, профессор кафедры криминалистики Национального исследовательского Томского государственного университета (Россия)
тел. +7-(382-2)-529-697
е-mail: ramil_ahmedshin@mail.ru
 
Селивёрстов Вячеслав Иванович
доктор юридических наук, профессор кафедры уголовного права и криминологии Юридического факультета Московского государственного университета им. М.В. Ломоносова, Заслуженный деятель науки Российской Федерации (Россия)
 
Ведерников Николай Трофимович
доктор юридических наук, профессор кафедры международного и конституционного права Российского экономического университета им. Г.В. Плеханова, Заслуженный юрист Российской Федерации (Россия)
 
Мазуркевич Яцек
доктор юридических наук, профессор Вроцлавского университета (Польша)
 
Гейстлингер Михаэль
профессор Зальбурцского университета (Австрия)
 
Холм Путцке
доктор юридических наук, профессор, заведующий кафедрой уголовного права и процесса Университета Пассау (Германия)
 
Сарсенбаев Талгат Есеналиевич
доктор юридических наук, профессор, заместитель руководителя Канцелярии Премьер-министра Республики Казахстан (Казахстан)
 
Велиев Исахан Вейсал-оглы
доктор юридических наук, профессор, руководитель аппарата фонда \xabЗнание\xbb при Президенте Азербайджанской Республики (Азербайджан)
 
Горазд Мешко
доктор юридических наук, профессор заведующий кафедрой криминологии Мариборского университета (Словения)
 
Срето Ного
доктор юридических наук, профессор Мегатрендского университета, Белград (Сербия)
 
Лун Чанхай
доктор юридических наук, профессор, проректор Маньчжурского института университета Внутренней Монголии (Китай)`},sociology_politics:{title:"Социология и политология",description:`
Рыкун Артём Юрьевич - председатель научной редакции
доктор социологических наук, профессор, проректор по международным связям, заведующий кафедрой социальной работы философского факультета Томского государственного университета (Россия)

Сухушина Елена Валерьевна - ответственный секретарь
кандидат философских наук, доцент, декан философского факультета Томского государственного университета (Россия)

Х. Балцер
профессор Университета Джорджтауна (США)

Н.Д. Вавилина
доктор социологических наук, профессор Новосибирского государственного университета экономики и управления "НИНХ" (Россия)

О.В. Гаман-Голутвина
доктор политических наук, профессор Московского государственного института международных отношений (Россия)

Л.В. Дериглазова
доктор исторических наук, профессор, профессор кафедры мировой политики факультета исторических и политических наук Томского государственного университета (Россия)

Е.А. Добренко
профессор университета Шеффилда (Великобритания)

М. Джонсон
профессор Университета Висконсина в Мадисоне (США)

В.В. Кашпур
кандидат социологических наук, доцент, заведующий кафедрой социологии философского факультета Томского государственного университета (Россия)

Д.Л. Константиновский
доктор социологических наук, руководитель отдела социологии образования Института социологии Федерального научно-исследовательского социологического центра Российской академии наук (Россия)

А.Ю. Мельвиль
доктор политических наук, профессор Национального исследовательского университета \xabВысшая школа экономики\xbb (г. Москва, Россия)

Ю.С. Пивоваров
доктор политических наук, профессор, академик РАН, ИНИОН РАН (г. Москва, Россия)

Н.С. Розов
доктор философских наук, профессор Новосибирского государственного университета (Россия).

Р. Саква
профессор Кентского университета (Великобритания)

А.И. Соловьев
доктор политических наук, профессор Московского государственного университета им. М.В. Ломоносова (Россия)

И.Х. Чалаков
профессор Пловдивского университета (Болгария)

М.Ф. Черныш
доктор социологических наук, член-корреспондент РАН, руководитель сектора социальной мобильности, врио директора Федерального научно-исследовательского социологического центра Российской академии наук (Россия)

Е.Б. Шестопал
доктор философских наук, профессор Московского государственного университета им. М.В. Ломоносова (Россия)

Н.Г. Щербинина
доктор политических наук, профессор кафедры политологии факультета исторических и политических наук Томского государственного университета (Россия)

Е.Р. Ярская-Смирнова
доктор социологических наук, профессор кафедры общей социологии факультета социальных наук Национального исследовательского университета "Высшая школа экономики" (Россия)
`},philology:{title:"Филология",description:`

Демешкина Татьяна Алексеевна - председатель научной редакции
профессор, доктор филологических наук, заведующая кафедрой русского языка, декан филологического факультета Томского государственного университета (Россия)
тел. +7-(382-2)-529-631, +7-(382-2)-534-077
 
Смольянинов Артем Витальевич - ответственный секретарь
ассистент кафедры общего литературоведения, издательского дела и редактирования Томского государственного университета (Россия)
e-mail: smoart1@bk.ru
 
Айзикова Ирина Александровна – заместитель главного редактора 
доктор филологических наук, заведующая кафедрой общего литературоведения, издательского дела и редактирования Томского государственного университета (Россия) 
Бейлин Джон Ф. (Университет штата Нью-Йорк в Стоуни-Брук, США)

Березович, Елена Львовна (Уральский федеральный университет, Россия)

Вартанова Елена Леонидовна (Московский государственный университет, Россия)

Голев Николай Данилович (Кемеровский государственный университет, Россия)

Добренко Евгений Александрович (Университет Шеффилда, Великобритания) 

Липовецкий Марк Наумович (Университет Колорадо в Боулдере, США) 

Резанова Зоя Ивановна (Томский государственный университет, Россия)

Силантьев Игорь Витальевич (Институт филологии, Новосибирск, Россия) 

Фрэнкс Стивен Л. (Индианский университет в Блумингтоне, США) 

Шмелева Татьяна Викторовна (Новгородский государственный университет, Россия) `},philosophy:{title:"Философия",description:`Суровцев Валерий Александрович - председатель научной редакции
доктор философских наук, зав. кафедрой истории философии и логики Томского государственного университета (Россия)
тел. +7-(382-2)-529-610
e-mail: surovtsev1964@mail.ru

Агафонова Елена Васильевна - ответственный секретарь
канд. филос. наук, доцент кафедры онтологии, теории познания и социальной философии Томского государственного университета (Россия)
тел. +7-(382-2)-529-784
e-mail: agaton@rambler.ru

Е.В. Афонасин
Новосибирский государственный университет (Россия)

Е.В. Борисов
Томский государственный университет (Россия)

Г. Хайнцман
Университет Лотарингии, г. Нанси (Франция)

К. Химма
Университет Вашингтона, г. Сиэтл (США)

В.В. Оглезнев
Томский государственный университет (Россия)

А.В. Родин
Санкт-Петербургский государственный университет (Россия)

В. Шпон
Университет Констанца, г. Констанц (Германия)

А. Тамминга
Университет Гронингена, Гронинген (Нидерланды)

В.В. Целищев
Институт философии и права, г. Новосибирск (Россия)`}};function a(){let e=(0,i.useParams)(),t=e?.category,o=decodeURIComponent(Array.isArray(t)?t[0]:t||""),a=o.replace(/-/g,"_");console.log("Category from URL:",o),console.log("Normalized category:",a),console.log("Available categories:",Object.keys(s));let n=s[a]||{title:"Ошибка",description:"Контент не найден"};return(0,r.jsxs)("div",{className:"max-w-4xl mx-auto p-6 m-6 text-xs",children:[(0,r.jsx)("h1",{className:"text-2xl font-bold",children:n.title}),(0,r.jsx)("p",{className:"mt-4 whitespace-pre-line",children:n.description})]})}},2002:(e,t,o)=>{"use strict";o.r(t),o.d(t,{default:()=>r});let r=(0,o(6760).registerClientReference)(function(){throw Error("Attempted to call the default export of \"/home/shaxzodbr/Desktop/Azizi/Azizi/app/editorials/editorial/[category]/page.tsx\" from the server, but it's on the client. It's not possible to invoke a client function from the server, it can only be rendered as a Component or passed to props of a Client Component.")},"/home/shaxzodbr/Desktop/Azizi/Azizi/app/editorials/editorial/[category]/page.tsx","default")},6055:(e,t,o)=>{"use strict";o.r(t),o.d(t,{default:()=>i});var r=o(8077);let i=async e=>[{type:"image/x-icon",sizes:"16x16",url:(0,r.fillMetadataSegment)(".",await e.params,"favicon.ico")+""}]}};var t=require("../../../../webpack-runtime.js");t.C(e);var o=e=>t(t.s=e),r=t.X(0,[638,348,607,77,854],()=>o(7633));module.exports=r})();